{"text":"Batman is a fictional superhero appearing in American comic books published by DC Comics.", "entity":"Batman", "Label": "SUPERHERO"}
{"text":"Batman's secret identity is Bruce Wayne, a wealthy American playboy, philanthropist, and owner of Wayne Enterprises.", "entity":"Batman", "Label": "SUPERHERO"}
{"text":"Batman operates in the fictional Gotham City with assistance from various supporting characters, including his butler Alfred, police commissioner Jim Gordon, and vigilante allies such as Robin.", "entity":"Batman", "Label": "SUPERHERO"}
{"text":"A large assortment of villains make up Batman's rogues gallery, including his archenemy, the Joker.", "entity":"Batman", "Label": "SUPERHERO"}
{"text":"The first Batman story, "The Case of the Chemical Syndicate", was published in Detective Comics #27 (May 1939).", "entity":"Batman", "Label": "SUPERHERO"}
{"text":"Spider-Man is a fictional superhero created by writer-editor Stan Lee and writer-artist Steve Ditko.", "entity":"Spider-Man", "Label": "SUPERHERO"}
{"text":"In a 1986 interview, Lee described in detail his arguments to overcome Goodman's objections.[note 2] Goodman eventually agreed to a Spider-Man tryout in what Lee in numerous interviews recalled as what would be the final issue of the science-fiction and supernatural anthology series Amazing Adult Fantasy, which was renamed Amazing Fantasy for that single issue, #15 (cover-dated August 1962, on sale June 5, 1962).", "entity":"Spider-Man", "Label": "SUPERHERO"}
{"text":"In particular, Lee stated that the fact that it had already been decided that Amazing Fantasy would be cancelled after issue #15 was the only reason Goodman allowed him to use Spider-Man.", "entity":"Spider-Man", "Label": "SUPERHERO"}
{"text":"From 1984 to 1988, Spider-Man wore a black costume with a white spider design on his chest.", "entity":"Spider-Man", "Label": "SUPERHERO"}
{"text":"From his high-school beginnings to his entry into college life, Spider-Man remained the superhero most relevant to the world of young people.", "entity":"Spider-Man", "Label": "SUPERHERO"}
{"text":"Thor (Thor Odinson) is a fictional superhero appearing in American comic books published by Marvel Comics.", "entity":"Thor", "Label": "SUPERHERO"}
{"text":"The Marvel Comics superhero Thor debuted in the science fiction/fantasy anthology title Journey into Mystery #83 (cover-date August 1962), and was created by editor-plotter Stan Lee, scripter Larry Lieber, and penciller-plotter Jack Kirby.", "entity":"Thor", "Label": "SUPERHERO"}
{"text":"Lee and Kirby included Thor in The Avengers #1 (Sept. 1963) as a founding member of the superhero team.", "entity":"Thor", "Label": "SUPERHERO"}
{"text":"Thor's father Odin decides his son needed to be taught humility and consequently places Thor (without memories of godhood) into the body and memories of an existing, partially disabled human medical student, Donald Blake.", "entity":"Thor", "Label": "SUPERHERO"}
{"text":"Falling in love with Jane Foster, Thor disobeys his father and refuses to return to Asgard, an act for which he is punished on several occasions.", "entity":"Thor", "Label": "SUPERHERO"}
{"text":"Captain America is a fictional superhero appearing in American comic books published by Marvel Comics.", "entity":"Captain America", "Label": "SUPERHERO"}
{"text":"Captain America was designed as a patriotic supersoldier who often fought the Axis powers of World War II and was Timely Comics' most popular character during the wartime period.", "entity":"Captain America", "Label": "SUPERHERO"}
{"text":"Captain America is the alter ego of Steve Rogers, a frail young man enhanced to the peak of human perfection by an experimental serum to aid the United States government's efforts in World War II.", "entity":"Captain America", "Label": "SUPERHERO"}
{"text":"Captain America was the first Marvel Comics character to appear in media outside comics with the release of the 1944 movie serial, Captain America.", "entity":"Captain America", "Label": "SUPERHERO"}
{"text":"In the story arc "The Death of Captain America", Rogers is fatally shot by Sharon Carter, whose actions are manipulated by the villain Dr. Faustus.", "entity":"Captain America", "Label": "SUPERHERO"}
{"text":"Wolverine (birth name: James Howlett;[1] colloquial: Logan, Weapon X) is a fictional character appearing in American comic books published by Marvel Comics, mostly in association with the X-Men.", "entity":"Wolverine", "Label": "SUPERHERO"}
{"text":"Wolverine is typical of the many tough antiheroes that emerged in American popular culture after the Vietnam War;[4]:265 his willingness to use deadly force and his brooding nature became standard characteristics for comic book antiheroes by the end of the 1980s.", "entity":"Wolverine", "Label": "SUPERHERO"}
{"text":"Marvel editor-in-chief Roy Thomas asked writer Len Wein to devise a character specifically named Wolverine, who is Canadian and of small stature and with a wolverine's fierce temper.", "entity":"Wolverine", "Label": "SUPERHERO"}
{"text":"Later, Professor Charles Xavier recruits Wolverine to a new iteration of his superhero-mutant team, the X-Men where he shares a relationship to Jean Grey with Cyclops.", "entity":"Wolverine", "Label": "SUPERHERO"}
{"text":"Feral by nature, Wolverine's mutation process will eventually cause him to degenerate physically into a more primitive, bestial state.", "entity":"Wolverine", "Label": "SUPERHERO"}